src/Embedded System/JTAG/Blackhawk.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Blackhawk
#+OPTIONS: num:nil H:2
Official site: http://www.blackhawk-dsp.com

* USB100v2(XDS100)
** JTAG EMULATION DRIVER DOWNLOAD
http://www.blackhawk-dsp.com/support/Drivers.aspx#BH-USB-100v2D
** Firmware Updates for the Blackhawk XDS100-class product
http://www.blackhawk-dsp.com/support/xds100/Default.aspx
** TI XDS100 Wiki Support Page
http://processors.wiki.ti.com/index.php/XDS100
** reprogam it
http://e2e.ti.com/support/dsp/c6000_multi-core_dsps/f/639/t/131875.aspx?pi24928=2
go back to http://processors.wiki.ti.com/index.php/XDS100#Q:_How_can_I_check_if_the_VID.2FPID_for_the_EEPROM_are_programmed_correctly.3F  note the part that says 

Note:It is possible to reprogram the EEPROM using MPROG or FT_Prog and
the .ept file. The .ept file depends on the type of device you have.
If you have a FT2232C device download the following FT2232C EPT file.
If you have a FT2232H device download the following FT2232H EPT file.
Refer to the instructions in the How to make an XDS100 section




