public_html/Embedded System/JTAG/Blackhawk.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Blackhawk</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Blackhawk"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-16 22:27:30 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Blackhawk</h1>

<p>Official site: <a href="http://www.blackhawk-dsp.com">http://www.blackhawk-dsp.com</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">USB100v2(XDS100)</a>
<ul>
<li><a href="#sec-1-1">JTAG EMULATION DRIVER DOWNLOAD</a></li>
<li><a href="#sec-1-2">Firmware Updates for the Blackhawk XDS100-class product</a></li>
<li><a href="#sec-1-3">TI XDS100 Wiki Support Page</a></li>
<li><a href="#sec-1-4">reprogam it</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">USB100v2(XDS100)</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">JTAG EMULATION DRIVER DOWNLOAD</h3>
<div class="outline-text-3" id="text-1-1">

<p><a href="http://www.blackhawk-dsp.com/support/Drivers.aspx#BH-USB-100v2D">http://www.blackhawk-dsp.com/support/Drivers.aspx#BH-USB-100v2D</a>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Firmware Updates for the Blackhawk XDS100-class product</h3>
<div class="outline-text-3" id="text-1-2">

<p><a href="http://www.blackhawk-dsp.com/support/xds100/Default.aspx">http://www.blackhawk-dsp.com/support/xds100/Default.aspx</a>
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">TI XDS100 Wiki Support Page</h3>
<div class="outline-text-3" id="text-1-3">

<p><a href="http://processors.wiki.ti.com/index.php/XDS100">http://processors.wiki.ti.com/index.php/XDS100</a>
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">reprogam it</h3>
<div class="outline-text-3" id="text-1-4">

<p><a href="http://e2e.ti.com/support/dsp/c6000_multi-core_dsps/f/639/t/131875.aspx?pi24928=2">http://e2e.ti.com/support/dsp/c6000_multi-core_dsps/f/639/t/131875.aspx?pi24928=2</a>
go back to <a href="http://processors.wiki.ti.com/index.php/XDS100#Q:_How_can_I_check_if_the_VID.2FPID_for_the_EEPROM_are_programmed_correctly.3F">http://processors.wiki.ti.com/index.php/XDS100#Q:_How_can_I_check_if_the_VID.2FPID_for_the_EEPROM_are_programmed_correctly.3F</a>  note the part that says 
</p>
<p>
Note:It is possible to reprogram the EEPROM using MPROG or FT<sub>Prog</sub> and
the .ept file. The .ept file depends on the type of device you have.
If you have a FT2232C device download the following FT2232C EPT file.
If you have a FT2232H device download the following FT2232H EPT file.
Refer to the instructions in the How to make an XDS100 section
</p>



</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-16 22:27:30 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
